; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl :conditional-effects)

(:types link angle)

(:predicates
	(AngleOrd ?a - angle ?a1 - angle)
	(HasAngle ?l - angle ?j - link)
	(Affected ?l1 - link ?l2 - link)
    (IsChildOf ?l1 - link ?l2 - link)
)

(:action increase_angle
:parameters (?child_link - link ?a1 ?a2 - angle)
:precondition (and 
	(HasAngle ?a1 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a1 ?child_link)) 
	    (HasAngle ?a2 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a3 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a3 ?ls))
			        (HasAngle ?a4 ?ls)
		        )
		    )
	    )
    )
)

(:action decrease_angle
:parameters (?child_link - link ?a2 ?a1 - angle)
:precondition (and 
	(HasAngle ?a2 ?child_link)
	(AngleOrd ?a1 ?a2)
	)
:effect 
    (and 
	    (not (HasAngle ?a2 ?child_link)) 
	    (HasAngle ?a1 ?child_link)
	    (forall (?ls - link ?a3 ?a4 - angle)
		    (when (and (Affected ?ls ?child_link) (HasAngle ?a4 ?ls) (AngleOrd ?a3 ?a4) )
		        (and
			        (not (HasAngle ?a4 ?ls))
			        (HasAngle ?a3 ?ls)
		        )
		    )
	    )
    )
)
)

; problem
(define (problem joint_bar_2)
(:domain joint_bar)
(:objects
    link1 link2 link3 link4 link5 link6 link7 - link
    angle0 angle20 angle40 angle60 angle80 angle100 angle120 angle140 angle160 angle180 angle200 angle220 angle240 angle260 angle280 angle300 angle320 angle340 - angle)
(:init
    (AngleOrd angle0 angle20)
    (AngleOrd angle20 angle40)
    (AngleOrd angle40 angle60)
    (AngleOrd angle60 angle80)
    (AngleOrd angle80 angle100)
    (AngleOrd angle100 angle120)
    (AngleOrd angle120 angle140)
    (AngleOrd angle140 angle160)
    (AngleOrd angle160 angle180)
    (AngleOrd angle180 angle200)
    (AngleOrd angle200 angle220)
    (AngleOrd angle220 angle240)
    (AngleOrd angle240 angle260)
    (AngleOrd angle260 angle280)
    (AngleOrd angle280 angle300)
    (AngleOrd angle300 angle320)
    (AngleOrd angle320 angle340)
    (AngleOrd angle340 angle0)

    (IsChildOf link2 link1)
    (IsChildOf link3 link2)
    (IsChildOf link4 link3)
    (IsChildOf link5 link4)
    (IsChildOf link6 link5)
    (IsChildOf link7 link6)

    (Affected link2 link1)
    (Affected link3 link1)
    (Affected link3 link2)
    (Affected link4 link1)
    (Affected link4 link2)
    (Affected link4 link3)
    (Affected link5 link1)
    (Affected link5 link2)
    (Affected link5 link3)
    (Affected link5 link4)
    (Affected link6 link1)
    (Affected link6 link2)
    (Affected link6 link3)
    (Affected link6 link4)
    (Affected link6 link5)
    (Affected link7 link1)
    (Affected link7 link2)
    (Affected link7 link3)
    (Affected link7 link4)
    (Affected link7 link5)
    (Affected link7 link6)

    (HasAngle angle260 link1)
    (HasAngle angle300 link2)
    (HasAngle angle0 link3)
    (HasAngle angle320 link4)
    (HasAngle angle340 link5)
    (HasAngle angle200 link6)
    (HasAngle angle80 link7)
)
(:goal
(and
    (HasAngle angle200 link1)
    (HasAngle angle200 link2)
    (HasAngle angle280 link3)
    (HasAngle angle260 link4)
    (HasAngle angle220 link5)
    (HasAngle angle80 link6)
    (HasAngle angle340 link7)
    )
)
)

; plan
1. (decrease_angle link1 angle260 angle240)
   deleted: (hasangle angle260 link1) (hasangle angle300 link2) (hasangle angle0 link3) (hasangle angle320 link4) (hasangle angle340 link5) (hasangle angle200 link6) (hasangle angle80 link7)
   added: (hasangle angle240 link1) (hasangle angle280 link2) (hasangle angle340 link3) (hasangle angle300 link4) (hasangle angle320 link5) (hasangle angle180 link6) (hasangle angle60 link7)
   goals met: 0 of 7
2. (decrease_angle link1 angle240 angle220)
   deleted: (hasangle angle240 link1) (hasangle angle280 link2) (hasangle angle340 link3) (hasangle angle300 link4) (hasangle angle320 link5) (hasangle angle180 link6) (hasangle angle60 link7)
   added: (hasangle angle220 link1) (hasangle angle260 link2) (hasangle angle320 link3) (hasangle angle280 link4) (hasangle angle300 link5) (hasangle angle160 link6) (hasangle angle40 link7)
   goals met: 0 of 7
3. (decrease_angle link1 angle220 angle200)
   deleted: (hasangle angle220 link1) (hasangle angle260 link2) (hasangle angle320 link3) (hasangle angle280 link4) (hasangle angle300 link5) (hasangle angle160 link6) (hasangle angle40 link7)
   added: (hasangle angle200 link1) (hasangle angle240 link2) (hasangle angle300 link3) (hasangle angle260 link4) (hasangle angle280 link5) (hasangle angle140 link6) (hasangle angle20 link7)
   goals met: 2 of 7
4. (decrease_angle link2 angle240 angle220)
   deleted: (hasangle angle240 link2) (hasangle angle300 link3) (hasangle angle260 link4) (hasangle angle280 link5) (hasangle angle140 link6) (hasangle angle20 link7)
   added: (hasangle angle220 link2) (hasangle angle280 link3) (hasangle angle240 link4) (hasangle angle260 link5) (hasangle angle120 link6) (hasangle angle0 link7)
   goals met: 2 of 7
5. (decrease_angle link6 angle120 angle100)
   deleted: (hasangle angle120 link6) (hasangle angle0 link7)
   added: (hasangle angle100 link6) (hasangle angle340 link7)
   goals met: 3 of 7
6. (decrease_angle link2 angle220 angle200)
   deleted: (hasangle angle220 link2) (hasangle angle280 link3) (hasangle angle240 link4) (hasangle angle260 link5) (hasangle angle100 link6) (hasangle angle340 link7)
   added: (hasangle angle200 link2) (hasangle angle260 link3) (hasangle angle220 link4) (hasangle angle240 link5) (hasangle angle80 link6) (hasangle angle320 link7)
   goals met: 3 of 7
7. (increase_angle link3 angle260 angle280)
   deleted: (hasangle angle260 link3) (hasangle angle220 link4) (hasangle angle240 link5) (hasangle angle80 link6) (hasangle angle320 link7)
   added: (hasangle angle280 link3) (hasangle angle240 link4) (hasangle angle260 link5) (hasangle angle100 link6) (hasangle angle340 link7)
   goals met: 4 of 7
8. (increase_angle link4 angle240 angle260)
   deleted: (hasangle angle240 link4) (hasangle angle260 link5) (hasangle angle100 link6) (hasangle angle340 link7)
   added: (hasangle angle260 link4) (hasangle angle280 link5) (hasangle angle120 link6) (hasangle angle0 link7)
   goals met: 4 of 7
9. (decrease_angle link5 angle280 angle260)
   deleted: (hasangle angle280 link5) (hasangle angle120 link6) (hasangle angle0 link7)
   added: (hasangle angle260 link5) (hasangle angle100 link6) (hasangle angle340 link7)
   goals met: 5 of 7
10. (decrease_angle link5 angle260 angle240)
   deleted: (hasangle angle260 link5) (hasangle angle100 link6) (hasangle angle340 link7)
   added: (hasangle angle240 link5) (hasangle angle80 link6) (hasangle angle320 link7)
   goals met: 5 of 7
11. (decrease_angle link5 angle240 angle220)
   deleted: (hasangle angle240 link5) (hasangle angle80 link6) (hasangle angle320 link7)
   added: (hasangle angle220 link5) (hasangle angle60 link6) (hasangle angle300 link7)
   goals met: 5 of 7
12. (increase_angle link6 angle60 angle80)
   deleted: (hasangle angle60 link6) (hasangle angle300 link7)
   added: (hasangle angle80 link6) (hasangle angle320 link7)
   goals met: 6 of 7
13. (increase_angle link7 angle320 angle340)
   deleted: (hasangle angle320 link7)
   added: (hasangle angle340 link7)
   goals met: 7 of 7
